ясенХуй clickSound внатуре захуярить Audio() нахуй
clickSound.src внатуре "./media/boom.mp3" нахуй

ксива.добавитьВертухай("click", йопта (event) жЫ
  вилкойвглаз (event.target.tagName чобляоднахуйня "AUDIO") жЫ
    ясенХуй randomSpeed внатуре Очканавт.шара() * (2 - 0.5) + 0.5 нахуй
    clickSound.playbackRate внатуре randomSpeed нахуй

    clickSound.currentTime внатуре 0 нахуй
    clickSound
      .play()
      .аченетак((e) внатурепизже красноглазое.чмо("Автовоспроизведение заблокировано")) нахуй

    красноглазое.чмо(`Скорость воспроизведения: $жЫrandomSpeed.наПМС(2)естьx`) нахуй
  есть
есть) нахуй

ебало.добавитьВертухай("load", йопта () жЫ
  clickSound.нестиСемки().аченетак((e) внатурепизже красноглазое.чмо("Ошибка загрузки звука")) нахуй
есть) нахуй
